perf/test_results/node/heavyRamp.txt
> perf@1.0.0 artillery /home/fabrizio/Escritorio/Arq soft/2c20-tp-1/perf
> artillery "run" "heavyTestRamp.yaml" "-e" "node"

Started phase 0 (PlainZero1), duration: 10s @ 12:44:15(-0300) 2020-11-08
Report @ 12:44:25(-0300) 2020-11-08
Elapsed time: 10 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Started phase 1 (Ramp), duration: 30s @ 12:44:25(-0300) 2020-11-08
Report @ 12:44:35(-0300) 2020-11-08
Elapsed time: 20 seconds
  Scenarios launched:  9
  Scenarios completed: 1
  Requests completed:  1
  Mean response/sec: 1
  Response time (msec):
    min: 5003.8
    max: 5003.8
    median: 5003.8
    p95: 5003.8
    p99: 5003.8
  Codes:
    200: 1

Report @ 12:44:45(-0300) 2020-11-08
Elapsed time: 30 seconds
  Scenarios launched:  16
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 1.78
  Response time (msec):
    min: 9525.8
    max: 14027.5
    median: 11776.6
    p95: 14027.5
    p99: 14027.5
  Codes:
    200: 2

Report @ 12:44:55(-0300) 2020-11-08
Elapsed time: 40 seconds
  Scenarios launched:  20
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 2
  Response time (msec):
    min: 18029
    max: 22530.5
    median: 20279.7
    p95: 22530.5
    p99: 22530.5
  Codes:
    200: 2

Started phase 2 (Plain), duration: 300s @ 12:44:56(-0300) 2020-11-08
Report @ 12:45:05(-0300) 2020-11-08
Elapsed time: 50 seconds
  Scenarios launched:  19
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 1.9
  Response time (msec):
    min: 25032
    max: 29531.5
    median: 27281.8
    p95: 29531.5
    p99: 29531.5
  Codes:
    200: 2

Report @ 12:45:15(-0300) 2020-11-08
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  20
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 2
  Response time (msec):
    min: 33534.2
    max: 37534.8
    median: 35534.5
    p95: 37534.8
    p99: 37534.8
  Codes:
    200: 2

Report @ 12:45:25(-0300) 2020-11-08
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  20
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 2
  Response time (msec):
    min: 40036.1
    max: 44036.7
    median: 42036.4
    p95: 44036.7
    p99: 44036.7
  Codes:
    200: 2

Report @ 12:45:35(-0300) 2020-11-08
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  20
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 2
  Response time (msec):
    min: 48037.1
    max: 52539.4
    median: 50288.2
    p95: 52539.4
    p99: 52539.4
  Codes:
    200: 2

Report @ 12:45:45(-0300) 2020-11-08
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  20
  Scenarios completed: 12
  Requests completed:  12
  Mean response/sec: 2
  Response time (msec):
    min: 57039.8
    max: 60002.5
    median: 60001.1
    p95: 60002.5
    p99: 60002.5
  Codes:
    200: 1
    504: 11

Report @ 12:45:55(-0300) 2020-11-08
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59997.5
    max: 60020.3
    median: 60000.5
    p95: 60010.7
    p99: 60020.3
  Codes:
    504: 20

Report @ 12:46:05(-0300) 2020-11-08
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  20
  Scenarios completed: 19
  Requests completed:  19
  Mean response/sec: 2
  Response time (msec):
    min: 60000
    max: 60002.1
    median: 60000.5
    p95: 60001.9
    p99: 60002.1
  Codes:
    504: 19

Report @ 12:46:15(-0300) 2020-11-08
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59999.1
    max: 60005.7
    median: 60000.5
    p95: 60005.2
    p99: 60005.7
  Codes:
    504: 20

Report @ 12:46:25(-0300) 2020-11-08
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 60003.6
    max: 60005.9
    median: 60004.7
    p95: 60005.9
    p99: 60005.9
  Codes:
    504: 20

Report @ 12:46:35(-0300) 2020-11-08
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 60004.6
    max: 60025.8
    median: 60004.8
    p95: 60015.8
    p99: 60025.8
  Codes:
    504: 20

Report @ 12:46:45(-0300) 2020-11-08
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 60003.3
    max: 60005.7
    median: 60004.6
    p95: 60005.6
    p99: 60005.7
  Codes:
    504: 20

Report @ 12:46:55(-0300) 2020-11-08
Elapsed time: 2 minutes, 40 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 60003.2
    max: 60006.2
    median: 60004.7
    p95: 60006
    p99: 60006.2
  Codes:
    504: 20

Report @ 12:47:05(-0300) 2020-11-08
Elapsed time: 2 minutes, 50 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 60003.1
    max: 60005.6
    median: 60004.7
    p95: 60005.4
    p99: 60005.6
  Codes:
    504: 20

Report @ 12:47:15(-0300) 2020-11-08
Elapsed time: 3 minutes, 0 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59999.5
    max: 60005.8
    median: 60004.7
    p95: 60005.8
    p99: 60005.8
  Codes:
    504: 20

Report @ 12:47:25(-0300) 2020-11-08
Elapsed time: 3 minutes, 10 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59999.3
    max: 60001.5
    median: 60000.5
    p95: 60001.4
    p99: 60001.5
  Codes:
    504: 20

Report @ 12:47:35(-0300) 2020-11-08
Elapsed time: 3 minutes, 20 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59999.4
    max: 60001.3
    median: 60000.4
    p95: 60001.1
    p99: 60001.3
  Codes:
    504: 20

Report @ 12:47:45(-0300) 2020-11-08
Elapsed time: 3 minutes, 30 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59999.5
    max: 60020.8
    median: 60000.5
    p95: 60011.3
    p99: 60020.8
  Codes:
    504: 20

Report @ 12:47:55(-0300) 2020-11-08
Elapsed time: 3 minutes, 40 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59999.3
    max: 60001.5
    median: 60000.5
    p95: 60001.2
    p99: 60001.5
  Codes:
    504: 20

Report @ 12:48:05(-0300) 2020-11-08
Elapsed time: 3 minutes, 50 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 60000.1
    max: 60001.3
    median: 60000.5
    p95: 60001.3
    p99: 60001.3
  Codes:
    504: 20

Report @ 12:48:15(-0300) 2020-11-08
Elapsed time: 4 minutes, 0 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59999.5
    max: 60001.5
    median: 60000.5
    p95: 60001.5
    p99: 60001.5
  Codes:
    504: 20

Report @ 12:48:25(-0300) 2020-11-08
Elapsed time: 4 minutes, 10 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59999.5
    max: 60003.8
    median: 60000.7
    p95: 60002.7
    p99: 60003.8
  Codes:
    504: 20

Report @ 12:48:35(-0300) 2020-11-08
Elapsed time: 4 minutes, 20 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59999.8
    max: 60001
    median: 60000.6
    p95: 60000.9
    p99: 60001
  Codes:
    504: 20

Report @ 12:48:45(-0300) 2020-11-08
Elapsed time: 4 minutes, 30 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59999.5
    max: 60001.5
    median: 60000.6
    p95: 60001.4
    p99: 60001.5
  Codes:
    504: 20

Report @ 12:48:55(-0300) 2020-11-08
Elapsed time: 4 minutes, 40 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59999.6
    max: 60001.7
    median: 60000.6
    p95: 60001.6
    p99: 60001.7
  Codes:
    504: 20

Report @ 12:49:05(-0300) 2020-11-08
Elapsed time: 4 minutes, 50 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59999.5
    max: 60001.3
    median: 60000.6
    p95: 60001.3
    p99: 60001.3
  Codes:
    504: 20

Report @ 12:49:15(-0300) 2020-11-08
Elapsed time: 5 minutes, 0 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59999.4
    max: 60001.4
    median: 60000.2
    p95: 60001.4
    p99: 60001.4
  Codes:
    504: 20

Report @ 12:49:25(-0300) 2020-11-08
Elapsed time: 5 minutes, 10 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59999.3
    max: 60001.5
    median: 60000.5
    p95: 60001.5
    p99: 60001.5
  Codes:
    504: 20

Report @ 12:49:35(-0300) 2020-11-08
Elapsed time: 5 minutes, 20 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59999.7
    max: 60000.5
    median: 60000.3
    p95: 60000.5
    p99: 60000.5
  Codes:
    504: 20

Report @ 12:49:45(-0300) 2020-11-08
Elapsed time: 5 minutes, 30 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59999.3
    max: 60000.9
    median: 60000.3
    p95: 60000.7
    p99: 60000.9
  Codes:
    504: 20

Report @ 12:49:55(-0300) 2020-11-08
Elapsed time: 5 minutes, 40 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2
  Response time (msec):
    min: 59999
    max: 60000.9
    median: 60000.4
    p95: 60000.8
    p99: 60000.9
  Codes:
    504: 20

Started phase 3 (PlainZero2), duration: 10s @ 12:49:56(-0300) 2020-11-08
Report @ 12:50:05(-0300) 2020-11-08
Elapsed time: 5 minutes, 50 seconds
  Scenarios launched:  11
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 1.1
  Response time (msec):
    min: 59999.4
    max: 60002.6
    median: 60001.5
    p95: 60002.6
    p99: 60002.6
  Codes:
    504: 20

Report @ 12:50:15(-0300) 2020-11-08
Elapsed time: 6 minutes, 0 seconds
  Scenarios launched:  2
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 0.2
  Response time (msec):
    min: 59999.5
    max: 60002.5
    median: 60001.4
    p95: 60002.5
    p99: 60002.5
  Codes:
    504: 20

Report @ 12:50:25(-0300) 2020-11-08
Elapsed time: 6 minutes, 10 seconds
  Scenarios launched:  0
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: NaN
  Response time (msec):
    min: 59998
    max: 60003.7
    median: 60001.4
    p95: 60003.5
    p99: 60003.7
  Codes:
    504: 20

Report @ 12:50:35(-0300) 2020-11-08
Elapsed time: 6 minutes, 20 seconds
  Scenarios launched:  0
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: NaN
  Response time (msec):
    min: 60000.4
    max: 60004.3
    median: 60002.2
    p95: 60004.2
    p99: 60004.3
  Codes:
    504: 20

Report @ 12:50:45(-0300) 2020-11-08
Elapsed time: 6 minutes, 30 seconds
  Scenarios launched:  0
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: NaN
  Response time (msec):
    min: 60000.2
    max: 60004.6
    median: 60002
    p95: 60004.5
    p99: 60004.6
  Codes:
    504: 20

Report @ 12:50:55(-0300) 2020-11-08
Elapsed time: 6 minutes, 40 seconds
  Scenarios launched:  0
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: NaN
  Response time (msec):
    min: 59998.3
    max: 60003.7
    median: 60001.9
    p95: 60003.7
    p99: 60003.7
  Codes:
    504: 20

Report @ 12:51:05(-0300) 2020-11-08
Elapsed time: 6 minutes, 50 seconds
  Scenarios launched:  0
  Scenarios completed: 11
  Requests completed:  11
  Mean response/sec: NaN
  Response time (msec):
    min: 59999.1
    max: 60002.4
    median: 60001.2
    p95: 60002.4
    p99: 60002.4
  Codes:
    504: 11

Report @ 12:51:06(-0300) 2020-11-08
Elapsed time: 6 minutes, 51 seconds
  Scenarios launched:  0
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: NaN
  Response time (msec):
    min: 59998.8
    max: 59999.5
    median: 59999.2
    p95: 59999.5
    p99: 59999.5
  Codes:
    504: 2

All virtual users finished
Summary report @ 12:51:06(-0300) 2020-11-08
  Scenarios launched:  657
  Scenarios completed: 657
  Requests completed:  657
  Mean response/sec: 1.64
  Response time (msec):
    min: 5003.8
    max: 60025.8
    median: 60000.6
    p95: 60005
    p99: 60005.9
  Scenario counts:
    Heavy (/heavy): 657 (100%)
  Codes:
    200: 14
    504: 643